Examinator/src/Documents/ПопыткаВыполненияСтатичногоОбъектаСУЗ/ПопыткаВыполненияСтатичногоОбъектаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияСтатичногоОбъектаСУЗ</name>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПопыткаВыполненияСтатичногоОбъектаСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	
	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
	
	Движение.Период                 = Дата;
	Движение.Пользователь           = Пользователь;
	Движение.ЭлементСодержания      = ЭлементСодержанияСводаЗнаний;
	Движение.ПрохождениеОбучения    = ПрохождениеОбучения;
	Движение.Задание                = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
	
	Если ПопыткаЗавершена Тогда
		Движение.Результат = 100;
	Иначе
		Движение.Результат = 0;
	КонецЕсли;
	
	Движение.ВремяПрохожденияВСекундах = ВремяВыполненияВСекундах;
	
	Движение.ЭлектронныйРесурс         = СводЗнаний;
	Движение.СсылкаНаОбъектСУЗ         = СсылкаНаОбъектСУЗ;
	Движение.ПопыткаЗавершена          = ПопыткаЗавершена;
	Движение.ДатаНачалаПрохождения     = ДатаНачалаВыполнения;
	Движение.ДатаОкончанияПрохождения  = ДатаОкончанияВыполнения;
	Движение.ЭтоТест                   = Ложь;
	Движение.НомерРегистратора         = Номер;
	Движение.ВыставляетсяОценка        = Ложь;
	Движение.ЗавершеноВПроцентах       = ?(ПопыткаЗавершена, 100, 0);
	
	ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
